cf_billing/InformationRegisters/бестСтабильныеПериодыНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСтабильныеПериодыНП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоговорЗаключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектРасчетаПодключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УслугаПодключена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриборВведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеНагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗависимаяТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСостоянияПрибора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МенялосьСостояниеПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МенялосьСостояниеФормулы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеНормативаЗаДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектУчаствуетВРаспределенииМКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетПоФормуле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТепловаяСоставляющая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаНорматива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыНачисленияПоНормативуНП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючНорматива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиНормативов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НетВозможностьУстановкиПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоставнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСхемыГВС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыСхемТеплоснабжения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидТепловогоПункта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыТепловыхПунктов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчаствуетВДолевойСхеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределенияОбъемаДолевойТУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределенияОстаткаДолевыеСхемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетИндивидуальногоПотребления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасовРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентДолевогоРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СхемаРасчетаПриВыходеПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндивидуальнаяНастройкаУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетПоФактическомуПотреблению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДиаметрСечения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксированныйОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорнойКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорЗаключенДоТП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетТолькоПоПоказаниям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНедопусков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодНачальногоНедопуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестАктированиеНедопускаДопускаЮЛ</v8:Type>
						<v8:Type>cfg:DocumentRef.бестУстановитьНагрузкуПоУслугам</v8:Type>
						<v8:Type>cfg:DocumentRef.бестИзменениеИндивидуальныхНастроекСезонности</v8:Type>
						<v8:Type>cfg:DocumentRef.бестУстановитьФормулуРасчетаТочекУчетаНП</v8:Type>
						<v8:Type>cfg:DocumentRef.бестАктПринятияПрибораУчетаККоммерческомуУчету</v8:Type>
						<v8:Type>cfg:DocumentRef.бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.бестНачислениеНП</v8:Type>
						<v8:Type>cfg:DocumentRef.бестУстановитьЗначениеПлощадиНП</v8:Type>
						<v8:Type>cfg:DocumentRef.бестОперацияСПриборомУчетаНП</v8:Type>
						<v8:Type>cfg:DocumentRef.бестОперацияСУслугамиНП</v8:Type>
						<v8:Type>cfg:DocumentRef.бестИзменитьДоговорПоУслуге</v8:Type>
						<v8:Type>cfg:DocumentRef.бестУстановитьГруппуПотребителейНП</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.бестУстановитьСпособНачисленияПоНормативуНП</v8:Type>
						<v8:Type>cfg:DocumentRef.бестЗаключениеДоговоровСЮридическимиЛицами</v8:Type>
						<v8:Type>cfg:DocumentRef.бестУстановитьПотребителейГВС</v8:Type>
						<v8:Type>cfg:DocumentRef.бестСменаПоставщикаНП</v8:Type>
						<v8:Type>cfg:DocumentRef.бестОперацияСОбъектамиНП</v8:Type>
						<v8:Type>cfg:DocumentRef.бестНачислениеЭлектроэнергии</v8:Type>
						<v8:Type>cfg:DocumentRef.бестУстановитьДатуПоверкиПУ</v8:Type>
						<v8:Type>cfg:DocumentRef.бестУстановитьПоказателиТемпературыВнутриПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/бестТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРЭМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправляющаяКомпания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияСубсидий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доходный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СНТДНТ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/InformationRegisters/бестСтабильныеПериодыНП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет значение индивидуальных площадей коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначениеИндивидуальныхПлощадейКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТексЗапросаЗначениеИндивидуальныхПлощадейКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, МКД";
		ИмяТаблицы 					= "СтабильныеПериодыНП";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
КонецПроцедуры

// Заполняет значение индивидуальных площадей МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначениеИндивидуальныхПлощадейМКД(Схема,ПараметрыОтбора,ТаблицаДляПомещения= "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначениеИндивидуальныхПлощадейМКД());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ПериодНачисления, МКД";
		ИмяТаблицы 					= "СтабильныеПериодыНП";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗначениеИндивидуальныхПлощадейМКД() 
	Текст  = 
	"ВЫБРАТЬ
	|	СтабильныеПериодыГруппировка.Организация КАК Организация,
	|	СтабильныеПериодыГруппировка.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыГруппировка.Район КАК Район,
	|	СтабильныеПериодыГруппировка.МКД КАК МКД,
	|	СтабильныеПериодыГруппировка.ОбъектРасчетаПомещение КАК ОбъектРасчетаПомещение,
	|	СтабильныеПериодыГруппировка.Услуга КАК Услуга,
	|	СтабильныеПериодыГруппировка.ЗначениеПлощади + СтабильныеПериодыГруппировка.ПлощадьСобственнаяПоставка КАК ЗначениеПлощади,
	|	СтабильныеПериодыГруппировка.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериодыНП.Организация КАК Организация,
	|		СтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыНП.Район КАК Район,
	|		СтабильныеПериодыНП.МКД КАК МКД,
	|		СтабильныеПериодыНП.ОбъектРасчета.Помещение КАК ОбъектРасчетаПомещение,
	|		СтабильныеПериодыНП.Услуга КАК Услуга,
	|		МАКСИМУМ(СтабильныеПериодыНП.ЗначениеПлощади) КАК ЗначениеПлощади,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА СтабильныеПериодыНП.Поставщик = СтабильныеПериодыНП.Договор.Контрагент
	|					ТОГДА СтабильныеПериодыНП.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ПлощадьСобственнаяПоставка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СтабильныеПериодыНП.Организация КАК Организация,
	|			СтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|			СтабильныеПериодыНП.Район КАК Район,
	|			СтабильныеПериодыНП.МКД КАК МКД,
	|			СтабильныеПериодыНП.ОбъектРасчета.Помещение КАК Помещение,
	|			СтабильныеПериодыНП.Услуга КАК Услуга,
	|			СтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(СтабильныеПериодыНП.НомерПозиции) КАК НомерПозиции,
	|			СтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	|			СтабильныеПериодыНП.Договор КАК Договор
	|		ИЗ
	|			РегистрСведений.бестСтабильныеПериодыНП КАК СтабильныеПериодыНП
	|		ГДЕ
	|			СтабильныеПериодыНП.Договор.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СтабильныеПериодыНП.Организация,
	|			СтабильныеПериодыНП.ПериодНачисления,
	|			СтабильныеПериодыНП.Район,
	|			СтабильныеПериодыНП.Услуга,
	|			СтабильныеПериодыНП.ТочкаУчета,
	|			СтабильныеПериодыНП.ОбъектРасчета,
	|			СтабильныеПериодыНП.Договор,
	|			СтабильныеПериодыНП.МКД,
	|			СтабильныеПериодыНП.ОбъектРасчета.Помещение) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК СтабильныеПериодыНП
	|			ПО ВложенныйЗапрос.Организация = СтабильныеПериодыНП.Организация
	|				И ВложенныйЗапрос.ПериодНачисления = СтабильныеПериодыНП.ПериодНачисления
	|				И ВложенныйЗапрос.Район = СтабильныеПериодыНП.Район
	|				И ВложенныйЗапрос.Услуга = СтабильныеПериодыНП.Услуга
	|				И ВложенныйЗапрос.ТочкаУчета = СтабильныеПериодыНП.ТочкаУчета
	|				И ВложенныйЗапрос.НомерПозиции = СтабильныеПериодыНП.НомерПозиции
	|				И ВложенныйЗапрос.ОбъектРасчета = СтабильныеПериодыНП.ОбъектРасчета
	|				И ВложенныйЗапрос.Договор = СтабильныеПериодыНП.Договор
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтабильныеПериодыНП.Организация,
	|		СтабильныеПериодыНП.ПериодНачисления,
	|		СтабильныеПериодыНП.Район,
	|		СтабильныеПериодыНП.Услуга,
	|		СтабильныеПериодыНП.МКД,
	|		СтабильныеПериодыНП.ОбъектРасчета.Помещение) КАК СтабильныеПериодыГруппировка";
	
	Возврат Текст;
	
КонецФункции

Функция ТексЗапросаЗначениеИндивидуальныхПлощадейКоллекцияПериодов()
	
	Текст = 
	"ВЫБРАТЬ
	|	СтабильныеПериодыНП.Организация КАК Организация,
	|	СтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНП.Район КАК Район,
	|	СтабильныеПериодыНП.МКД КАК МКД,
	|	СтабильныеПериодыНП.ОбъектРасчета.Помещение КАК Помещение,
	|	СтабильныеПериодыНП.Услуга КАК Услуга,
	|	МАКСИМУМ(СтабильныеПериодыНП.ЗначениеПлощади) КАК ЗначениеПлощади,
	|	СУММА(ВЫБОР
	|			КОГДА СтабильныеПериодыНП.Поставщик = СтабильныеПериодыНП.Договор.Контрагент
	|				ТОГДА СтабильныеПериодыНП.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПлощадьСобственнаяПоставка
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериодыНП.Организация КАК Организация,
	|		СтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыНП.Район КАК Район,
	|		СтабильныеПериодыНП.МКД КАК МКД,
	|		СтабильныеПериодыНП.ОбъектРасчета.Помещение КАК Помещение,
	|		СтабильныеПериодыНП.Услуга КАК Услуга,
	|		СтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(СтабильныеПериодыНП.НомерПозиции) КАК НомерПозиции,
	|		СтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	|		СтабильныеПериодыНП.Договор КАК Договор
	|	ИЗ
	|		РегистрСведений.бестСтабильныеПериодыНП КАК СтабильныеПериодыНП
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО СтабильныеПериодыНП.Организация = ТаблицаПериодов.Организация
	|				И СтабильныеПериодыНП.Район = ТаблицаПериодов.Район
	|				И СтабильныеПериодыНП.ПериодНачисления = ТаблицаПериодов.ПериодНачисления
	|	ГДЕ
	|		СтабильныеПериодыНП.Договор.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтабильныеПериодыНП.Организация,
	|		СтабильныеПериодыНП.ПериодНачисления,
	|		СтабильныеПериодыНП.Район,
	|		СтабильныеПериодыНП.Услуга,
	|		СтабильныеПериодыНП.ТочкаУчета,
	|		СтабильныеПериодыНП.ОбъектРасчета,
	|		СтабильныеПериодыНП.Договор,
	|		СтабильныеПериодыНП.МКД,
	|		СтабильныеПериодыНП.ОбъектРасчета.Помещение) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК СтабильныеПериодыНП
	|		ПО ВложенныйЗапрос.Организация = СтабильныеПериодыНП.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = СтабильныеПериодыНП.ПериодНачисления
	|			И ВложенныйЗапрос.Район = СтабильныеПериодыНП.Район
	|			И ВложенныйЗапрос.МКД = СтабильныеПериодыНП.МКД
	|			И ВложенныйЗапрос.Услуга = СтабильныеПериодыНП.Услуга
	|			И ВложенныйЗапрос.ТочкаУчета = СтабильныеПериодыНП.ТочкаУчета
	|			И ВложенныйЗапрос.НомерПозиции = СтабильныеПериодыНП.НомерПозиции
	|			И ВложенныйЗапрос.ОбъектРасчета = СтабильныеПериодыНП.ОбъектРасчета
	|			И ВложенныйЗапрос.Договор = СтабильныеПериодыНП.Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыНП.Организация,
	|	СтабильныеПериодыНП.ПериодНачисления,
	|	СтабильныеПериодыНП.Район,
	|	СтабильныеПериодыНП.Услуга,
	|	СтабильныеПериодыНП.МКД,
	|	СтабильныеПериодыНП.ОбъектРасчета.Помещение";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
